# -*- coding: utf-8 -*-
#+STARTUP: indent
#+AUTHOR: Felix Dangel
# export using org-gfm-export-to-markdown
# export .py script using org-babel-tangle

** Model
  For simplicity, our model will be a linear layer mapping the 784-dimensional images to 10-dimensional outputs.
  Note that instead of ~torch.nn.Linear~, we use the extended layer provided by ~bpexts.hbp.linear~.
  The signature of the constructor is identical.
  #+BEGIN_SRC python :results output :exports both :session :tangle 01_single_layer_mnist.py
    # layer parameters
    in_features = 784
    out_features = 10
    bias = True

    # linear layer
    model = HBPLinear(in_features=in_features, out_features=out_features, bias=bias)
    # load to device
    model.to(device)
    print(model)
  #+END_SRC

  #+RESULTS:
  : HBPLinear(in_features=784, out_features=10, bias=True, buffers: 0, hooks: 1, avg_param_jac: True)

  ~HBPLinear~ implements the computation of curvature matrix estimates. The forward pass and gradient computation are in complete analogy to ~torch.nn.Linear~.
  Moreover, the ~print~ statement of the module shows some additional parameters:

  - It is decorated with ~hooks~ that will store ~buffers~ during the forward/backward pass in order to perform HBP
  - There are different approximation modes (indicated by ~avg_param_jac~) for HBP
 
  For more details, please refer to our [[hbp:paper][paper]].
